# UISaveAsOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UISaveAsOptions Constructor
UISaveAsOptions Class See Also
---
Default constructor.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public UISaveAsOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
UISaveAsOptions()
```

# See Also
UISaveAsOptions Class
Autodesk.Revit.UI Namespace